STM32-SDR/STM32-SDR/STM32-SDR/code/guiDrivers/src/LcdDriver_ILI9320.c
	TIM_TimeBaseStructure.TIM_Prescaler = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_Period = TimerPeriod;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);

	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;
	//TIM_OCInitStructure.TIM_Pulse = Channel3Pulse;
	TIM_OCInitStructure.TIM_Pulse = Channel1Pulse;
	TIM_OC3Init(TIM1, &TIM_OCInitStructure);
	TIM_Cmd(TIM1, ENABLE);
	TIM_CtrlPWMOutputs(TIM1, ENABLE);
}


void LCD_BackLight(int procentOn)
{
	if (procentOn > 100) {
		procentOn = 100;
	}
	if (procentOn < 0) {
		procentOn = 0;
	}

	uint16_t TimerPeriod = (SystemCoreClock / 17570) - 1;
	uint16_t channel1Pulse =
			(uint16_t) (((uint32_t) procentOn * (TimerPeriod - 1)) / 100);
	TIM_TimeBaseStructure.TIM_Period = TimerPeriod;
	TIM_OCInitStructure.TIM_Pulse = channel1Pulse;
	TIM_OC1Init(TIM1, &TIM_OCInitStructure);
}

// Configure the Flexible Static Memory Controller to map the LCD RAM to processor RAM.
static void LCD_FSMCConfig(void)
{
	FSMC_NORSRAMInitTypeDef FSMC_NORSRAMInitStructure;
	FSMC_NORSRAMTimingInitTypeDef FSMC_NORSRAMTimingInitStructure;
	FSMC_NORSRAMTimingInitStructure.FSMC_AddressSetupTime = 0;  //0
	FSMC_NORSRAMTimingInitStructure.FSMC_AddressHoldTime = 0;   //0
	FSMC_NORSRAMTimingInitStructure.FSMC_DataSetupTime = 2;     //3
	FSMC_NORSRAMTimingInitStructure.FSMC_BusTurnAroundDuration = 0;
	FSMC_NORSRAMTimingInitStructure.FSMC_CLKDivision = 1;     //1
	FSMC_NORSRAMTimingInitStructure.FSMC_DataLatency = 0;
	FSMC_NORSRAMTimingInitStructure.FSMC_AccessMode = FSMC_AccessMode_A;

	FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM1;
	FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable;
	FSMC_NORSRAMInitStructure.FSMC_MemoryType = FSMC_MemoryType_SRAM;
	FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;
	FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
	FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
	FSMC_NORSRAMInitStructure.FSMC_WrapMode = FSMC_WrapMode_Disable;
	FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
	FSMC_NORSRAMInitStructure.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
	FSMC_NORSRAMInitStructure.FSMC_WaitSignal = FSMC_WaitSignal_Disable;
	FSMC_NORSRAMInitStructure.FSMC_AsynchronousWait = FSMC_AsynchronousWait_Disable;
	FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = FSMC_ExtendedMode_Disable;
	FSMC_NORSRAMInitStructure.FSMC_WriteBurst = FSMC_WriteBurst_Enable; //disable
	FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &FSMC_NORSRAMTimingInitStructure;

	FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure);
	FSMC_NORSRAMTimingInitStructure.FSMC_AddressSetupTime = 0;    //0
	FSMC_NORSRAMTimingInitStructure.FSMC_AddressHoldTime = 0;	//0
	FSMC_NORSRAMTimingInitStructure.FSMC_DataSetupTime = 4;	//3
	FSMC_NORSRAMTimingInitStructure.FSMC_BusTurnAroundDuration = 0;
	FSMC_NORSRAMTimingInitStructure.FSMC_CLKDivision = 1;	//1
	FSMC_NORSRAMTimingInitStructure.FSMC_DataLatency = 0;
	FSMC_NORSRAMTimingInitStructure.FSMC_AccessMode = FSMC_AccessMode_A;
	FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &FSMC_NORSRAMTimingInitStructure;
	FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure);

	FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);
}

static void LCD_Reset(void)
{
	/* Power Down the reset */
	GPIO_WriteBit(GPIOB, GPIO_Pin_1, Bit_RESET);

	/* wait for a delay to insure registers erasing */
	TFT_Delay(0x4FFF);

	/* Power on the reset */
	GPIO_WriteBit(GPIOB, GPIO_Pin_1, Bit_SET);
}





//////////////////////////////////////////////////////////////////////////////////////////////////////
//
//
//		From TFT_Display.c
//
//
//////////////////////////////////////////////////////////////////////////////////////////////////////


#define DEBUG_REGMISMATCH 0
#if DEBUG_REGMISMATCH == 1
volatile int threadWatch_LCDREG = 0;
volatile int LCDRegMismatchCount_A1 = 0;
volatile int LCDRegMismatchCount_A2 = 0;
volatile int LCDRegMismatchCount_A3 = 0;
volatile int LCDRegMismatchCount_A4 = 0;
volatile uint8_t LCDRegMismatch_BadReg = 0;
volatile int LCDRegMismatchCount_B1 = 0;
volatile int LCDRegMismatchCount_B2 = 0;
volatile int LCDRegMismatchCount_B3 = 0;
volatile int LCDRegMismatchCount_B4 = 0;
#endif

// ***********************************************************************************
// Register access routines
// ***********************************************************************************
void LCD_WriteReg(uint8_t selectedReg, uint16_t regValue)
{
	// Catch threadsafe problem.
	static uint8_t threadSafeCheck = 0;
	assert(threadSafeCheck == 0);
	threadSafeCheck++;
	assert(threadSafeCheck == 1);

	// Loop until the value is set correctly
	// Note: This is a bit of a hack! But it works...
	uint8_t count = 0;
	do {
		LCD_REG = selectedReg;
		if (count++ > 100) {
			assert(0);
			break;
		}
	} while (LCD_REG != selectedReg);

	LCD_RAM = regValue;

	// Catch threadsafe problem.
	assert(threadSafeCheck == 1);
	threadSafeCheck--;
	assert(threadSafeCheck == 0);
}
void LCD_WriteRAM_Prepare(void)
{
	// Catch threadsafe problem.
	static uint8_t threadSafeCheck = 0;
	assert(threadSafeCheck == 0);
	threadSafeCheck++;
	assert(threadSafeCheck == 1);

#if DEBUG_REGMISMATCH == 1
	LCD_REG = 0x22;
	if (LCD_REG != 0x22) {
		LCDRegMismatchCount_B1++;
		if (LCD_REG != 0x22) {
			LCDRegMismatchCount_B2++;
			if (LCD_REG != 0x22) {
				LCDRegMismatchCount_B3++;
				LCD_REG = 0x22;
				if (LCD_REG != 0x22) {
					LCDRegMismatchCount_B4++;
				}
			}
		}
	}
#else
	// Loop until the value is set correctly
	uint8_t count = 0;
	do {
		LCD_REG = 0x22;
		if (count++ > 100) {
			assert(0);
			return;
		}
	} while (LCD_REG != 0x22);
#endif

