STM32-SDR/STM32-SDR/STM32-SDR/code/guiDrivers/src/LcdDriver_ILI9320.c
	// Catch threadsafe problem.
	assert(threadSafeCheck == 1);
	threadSafeCheck--;
	assert(threadSafeCheck == 0);
}

void LCD_WriteRAM_PrepareDir(LCD_WriteRAM_Direction direction)
{
	uint16_t r3Cmd = 0;

	switch (direction) {
	case LCD_WriteRAMDir_Right:
		r3Cmd = BUILD_R3_CMD(R3_INCRCEMENT, R3_INCRCEMENT, R3_CHANGEADDR_X);
		break;
	case LCD_WriteRAMDir_Left:
		r3Cmd = BUILD_R3_CMD(R3_DECREMENT, R3_INCRCEMENT, R3_CHANGEADDR_X);
		break;
	case LCD_WriteRAMDir_Up:
		r3Cmd = BUILD_R3_CMD(R3_INCRCEMENT, R3_DECREMENT, R3_CHANGEADDR_Y);
		break;
	case LCD_WriteRAMDir_Down:
		r3Cmd = BUILD_R3_CMD(R3_INCRCEMENT, R3_INCRCEMENT, R3_CHANGEADDR_Y);
		break;
	default:
		assert(0);
	}

	switch (s_currentLCD) {
	case LCD_ILI9320:
		LCD_WriteReg(R3, r3Cmd);
		break;
	case LCD_SSD1289:
		LCD_WriteReg(0x11, r3Cmd);
		break;
	default:
		assert(0);
	}

	LCD_WriteRAM_Prepare();
}
void LCD_WriteRAM(uint16_t RGB_Code)
{
	LCD_RAM = RGB_Code;

	// TODO: Why is this delay needed? Without it, nothing appears on LCD!??
	//	TFT_Delay(50);
	TFT_Delay(10);
}



uint16_t LCD_ReadReg(uint8_t LCD_Reg)
{
	// TODO: Not sure if this works; copied from a different file (stm32100e_eval_lcd.c).
	// Seems to work for reading the version at startup, but does not seem to read other registers.
	/* Write 16-bit Index (then Read Reg) */
	LCD_REG = LCD_Reg;
	/* Read 16-bit Reg */
	uint16_t regValue = LCD_RAM;
	regValue = LCD_RAM;
	regValue = LCD_RAM;

	return regValue;
}
uint16_t LCD_ReadRAM(void)
{
	return LCD_ReadReg(R34);
}

// ***********************************************************************************
// Register access routines
// ***********************************************************************************
/**
 * @brief  Sets a display window used for RAM writes. When calling this function to restrict
 *         the write window from within a function, that function should also re-call this
 *         function to reset the write-window back to the full screen.
 * @param  x: specifies the X top left corner.
 * @param  y: specifies the Y top left corner.
 * @param  height: display window height.
 * @param  width: display window width.
 * @retval None
 */
void LCD_SetDisplayWindow(uint16_t x, uint16_t y, uint16_t height, uint16_t width)
{
	uint16_t rotatedY1 = LCD_ROTATE_GETY(x, y);
	uint16_t rotatedY2 = LCD_ROTATE_GETY(x + width - 1, y + height - 1);
	uint16_t rotatedX1 = LCD_ROTATE_GETX(x, y);
	uint16_t rotatedX2 = LCD_ROTATE_GETX(x + width - 1, y + height - 1);

#define MAX(a, b) ((a)>(b)?(a):(b))
#define MIN(a, b) ((a)<(b)?(a):(b))

	uint16_t xStart = MIN(rotatedX1, rotatedX2);
	uint16_t xEnd   = MAX(rotatedX1, rotatedX2);
	uint16_t yStart = MIN(rotatedY1, rotatedY2);
	uint16_t yEnd   = MAX(rotatedY1, rotatedY2);

	xStart = MAX(0, xStart);
	xEnd   = MIN(LCD_ACTUAL_SCREEN_WIDTH-1, xEnd);
	yStart = MAX(0, yStart);
	yEnd   = MIN(LCD_ACTUAL_SCREEN_HEIGHT-1, yEnd);


	switch (s_currentLCD) {
	case LCD_ILI9320:
		LCD_WriteReg(0x0050, xStart); // Window X start address
		LCD_WriteReg(0x0051, xEnd); // Window X end address
		LCD_WriteReg(0x0052, yStart); // Window Y start address
		LCD_WriteReg(0x0053, yEnd); // Window Y end address
		break;
	case LCD_SSD1289:
	{
		uint16_t horizontalRamAddrReg = (xEnd << 8) | xStart;
		LCD_WriteReg(0x0044, horizontalRamAddrReg); // Window X end & start address
		LCD_WriteReg(0x0045, yStart); // Window Y start address
		LCD_WriteReg(0x0046, yEnd); // Window Y end address
		break;
	}
	default:
		assert(0);
	}

	LCD_SetCursor(x, y);
}
void LCD_ResetDisplayWindow(void)
{
	LCD_SetDisplayWindow(0, 0, LCD_HEIGHT, LCD_WIDTH);
}
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
	switch (s_currentLCD) {
	case LCD_ILI9320:
		LCD_WriteReg(0x20, LCD_ROTATE_GETX(Xpos, Ypos));
		LCD_WriteReg(0x21, LCD_ROTATE_GETY(Xpos, Ypos));
		break;
	case LCD_SSD1289:
		LCD_WriteReg(0x4E, LCD_ROTATE_GETX(Xpos, Ypos));
		LCD_WriteReg(0x4F, LCD_ROTATE_GETY(Xpos, Ypos));
		break;
	default:
		assert(0);
	}
}

void LCD_DisplayOn(void)
{
	LCD_WriteReg(0x07, 0x0173);
}
void LCD_DisplayOff(void)
{
	LCD_WriteReg(0x07, 0x0000);
}



void LCD_PutPixel(uint16_t Xpos, uint16_t Ypos, uint16_t Color)
{
	LCD_SetCursor(Xpos, Ypos);
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(Color);
}

uint16_t LCD_GetPixel(uint16_t Xpos, uint16_t Ypos)
{
	// TODO: Unable to have GetPixel working.
	// - Data sheet suggests have to read ram twice, but does not seem to help.
	// - Perhaps TTY debugging would help be able to display values quickly?
#if 0
	uint16_t tmpColor = 0, tmpRed = 0, tmpBlue = 0;

	/*Read the color of given pixel*/
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);
	LCD_SetCursor(Xpos, Ypos);
	tmpColor = LCD_ReadRAM();

	/*Swap the R and B color channels*/
	tmpRed = (tmpColor & Blue) << 11;
	tmpBlue = (tmpColor & Red) >> 11;
	tmpColor &= ~(Red | Blue);
	tmpColor |= (tmpRed | tmpBlue);

	return tmpColor;
#else
	return 0;
#endif
}


// ***********************************************************************************
// Drawing Routines
// ***********************************************************************************
/*
 * Draw a 16-bit bitmap to the screen.
 *  Image Generation Tip:
 *  	Use Gimp, load image, File --> Export, type C source code,
 *  	"Save as RGB454 (16-bit)"
 */
void LCD_DrawBMP16Bit(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revByteOrder)
{
	int numPixels = width * height;

	LCD_SetDisplayWindow(x, y, height, width);
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);

	// Push bitmap data to screen.
	for (int wordNum = 0; wordNum < numPixels; wordNum++) {
		uint16_t color = (*(pBitmap + wordNum));
		if (revByteOrder) {
			color = ((color & 0x00FF) << 8) | ((color & 0xFF00) >> 8);
		}
		LCD_WriteRAM( color );
	}
	LCD_ResetDisplayWindow();
}


// Draw a 1-bit bitmap (monochrome) to the screen.
// Assume each row of bits starts on a new word (i.e., pad last word per row with 0 bits)
void LCD_DrawBMP1Bit(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revBitOrder)
{
	LCD_SetDisplayWindow(x, y, height, width);
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);

	// Push bitmap data to screen.
	int word = 0;
	for (int row = 0; row < height; row++) {
		for (int col = 0; col < width; col++) {

			// On screen?
			if (x < 0 || x + col >= LCD_WIDTH || y < 0 || y + row >= LCD_HEIGHT) {
				continue;
			}

			// Setup the word:
			if (col % 16 == 0 && col > 0) {
				word++;
			}

			int bit = col % 16;
			if (revBitOrder) {
				bit = 15 - bit;
			}

			uint16_t turnOn = pBitmap[word] & (1 << bit);
			if (turnOn) {
				LCD_WriteRAM( LCD_textColor );
			} else {
				LCD_WriteRAM( LCD_backColor );
			}
		}
		// Assume next row starts on new byte:
		word++;
	}
	LCD_ResetDisplayWindow();
}

