STM32-SDR/STM32-SDR/STM32-SDR/code/guiDrivers/src/LcdDriver_ILI9320.c
// Draw a 1-bit bitmap transparent (monochrome) to the screen.
// Assume each row of bits starts on a new word (i.e., pad last word per row with 0 bits)
// TODO: If this is fast enough, use the pixel-by-pixel approach for transparent and non (reduce duplication)
void LCD_DrawBMP1BitTransparent(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revBitOrder)
{
	// Push bitmap data to screen.
	int word = 0;
	for (int row = 0; row < height; row++) {
		for (int col = 0; col < width; col++) {

			// On screen?
			if (x < 0 || x + col >= LCD_WIDTH || y < 0 || y + row >= LCD_HEIGHT) {
				continue;
			}

			// Setup the word:
			if (col % 16 == 0 && col > 0) {
				word++;
			}

			int bit = col % 16;
			if (revBitOrder) {
				bit = 15 - bit;
			}

			uint16_t turnOn = pBitmap[word] & (1 << bit);
			if (turnOn) {
				LCD_PutPixel(x + col, y + row, LCD_textColor);
			} else {
				// Nothing; it's transparent!
			}
		}
		// Assume next row starts on new byte:
		word++;
	}
}

void LCD_SetTextColor(__IO uint16_t Color)
{
	LCD_textColor = Color;
}

void LCD_SetBackColor(__IO uint16_t Color)
{
	LCD_backColor = Color;
}

void LCD_Clear(uint16_t Color)
{
	LCD_ResetDisplayWindow();
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);

	for (uint16_t y = 0; y < LCD_HEIGHT; y++) {
		for (uint16_t x = 0; x < LCD_WIDTH; x++) {
			LCD_WriteRAM(Color);
		}
	}
}

void LCD_DrawLine(uint16_t xStart, uint16_t yStart, uint16_t length, LCD_WriteRAM_Direction direction)
{
	LCD_SetCursor(xStart, yStart);
	LCD_WriteRAM_PrepareDir(direction);
	for (uint16_t i = 0; i < length; i++) {
		LCD_WriteRAM(LCD_textColor);
	}
}

void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
	LCD_DrawLine(Xpos, Ypos, Width, LCD_WriteRAMDir_Right);
	LCD_DrawLine(Xpos, Ypos + Height - 1, Width, LCD_WriteRAMDir_Right);
	LCD_DrawLine(Xpos, Ypos, Height, LCD_WriteRAMDir_Down);
	LCD_DrawLine(Xpos + Width - 1, Ypos, Height, LCD_WriteRAMDir_Down);
}

void LCD_DrawFilledRect(int x, int y, int height, int width)
{
	int numPixels = width * height;

	LCD_SetDisplayWindow(x, y, height, width);
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);

	// Push pixels to the screen
	for (int wordNum = 0; wordNum < numPixels; wordNum++) {
		LCD_WriteRAM(LCD_textColor);
	}
	LCD_ResetDisplayWindow();
}


//////////////////////////////////////////////////////////////////////////////////////////////////////
//		Test functions
//////////////////////////////////////////////////////////////////////////////////////////////////////
void LCD_TestDisplayScreen(void)
{
	// Test clear screen
	LCD_Clear(LCD_COLOR_BLUE);
	LCD_Clear(LCD_COLOR_RED);
	LCD_Clear(LCD_COLOR_GREEN);
	LCD_Clear(LCD_COLOR_YELLOW);
	LCD_Clear(LCD_COLOR_BLACK);

	// Test horizontal and vertical lines
	// Lines from origin (top-left)
	LCD_SetTextColor(LCD_COLOR_WHITE);
	LCD_DrawLine(0,0, 100, LCD_WriteRAMDir_Right);
	LCD_DrawLine(0,10, 100, LCD_WriteRAMDir_Right);
	LCD_SetTextColor(LCD_COLOR_YELLOW);
	LCD_DrawLine(0,0, 100, LCD_DIR_VERTICAL);

	// Lines into bottom right corner.
	LCD_SetTextColor(LCD_COLOR_RED);
	LCD_DrawLine(LCD_WIDTH-200-1,LCD_HEIGHT-1, 200, LCD_WriteRAMDir_Right);
	LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_DrawLine(LCD_WIDTH-1,LCD_HEIGHT-50-1, 50, LCD_WriteRAMDir_Down);

	// Draw + in middle of screen
	int midX = LCD_WIDTH / 2;
	int midY = LCD_HEIGHT / 2;
	int crossLen = 50;
	LCD_SetTextColor(LCD_COLOR_RED);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Right);
	LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Down);
	LCD_SetTextColor(LCD_COLOR_BLUE);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Left);
	LCD_SetTextColor(LCD_COLOR_YELLOW);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Up);

	LCD_SetBackColor(LCD_COLOR_BLUE);
	uint16_t data[] = {
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
	};
	LCD_SetTextColor(LCD_COLOR_WHITE);
	LCD_DrawBMP1Bit(midX+75, midY+75, 5, 48, data, 0);


	// Test DrawRect
	LCD_SetTextColor(LCD_COLOR_RED);
	LCD_DrawRect(10, 50, 150, 50);
	LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_DrawRect(60, 50, 150, 50);
	LCD_SetTextColor(LCD_COLOR_BLUE);
	LCD_DrawRect(110, 50, 150, 50);

	// Test Display Off/On
	LCD_DisplayOff();
	LCD_DisplayOn();
	LCD_BackLight(50);
	LCD_BackLight(0);
	LCD_BackLight(100);

	// Test drawing a bitmap
	LCD_DrawBMP16Bit(0,0, gimp_image.height, gimp_image.width, (uint16_t*) gimp_image.pixel_data, 0);

#if 0
	// Test put/get pixel
	LCD_PutPixel(10, 10, 0x1234);
	assert(LCD_GetPixel(10, 10) == 0x1234);
	LCD_PutPixel(10, 10, Red);
	assert(LCD_GetPixel(10, 10) == LCD_COLOR_RED);
	LCD_PutPixel(10, 10, Green);
	assert(LCD_GetPixel(10, 10) == LCD_COLOR_GREEN);
	LCD_PutPixel(10, 10, Blue);
	assert(LCD_GetPixel(10, 10) == LCD_COLOR_BLUE);
#endif

	volatile int a = 0;
	while (1)
		a ++;
}
